tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
tap "microsoft/mssql-release"

# CORE STUFF #
brew "coreutils"          # GNU File, Shell, and Text utilities
brew "fd"                 # Simple, fast and user-friendly alternative to find
brew "fzf"                # Command-line fuzzy finder written in Go
brew "zsh-autosuggestions"# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions"    # Additional completion definitions for zsh
brew "zsh-history-substring-search" # Zsh port of Fish shell's history search
brew "zsh-syntax-highlighting" # Fish shell like syntax highlighting for zsh
brew "romkatv/powerlevel10k/powerlevel10k" # A Zsh Theme
brew "tldr"               # Simplified and community-driven man pages
brew "tree"               # Display directories as trees (with optional color/HTML output)
cask "iterm2"             # iTerm2 - Terminal emulator as alternative to Apple's Terminal app

# CORE UTILS #
brew "htop"               # Improved top (interactive process viewer)
brew "ack"                # Search tool like grep, but optimized for programmers
brew "jq"                 # Lightweight and flexible command-line JSON processor
brew "neofetch"           # Fast, highly customisable system info script
brew "wget"               # Internet file retriever
brew "yq"                 # Process YAML, JSON, XML, CSV and properties documents from the CLI


# FRAMEWORKS - All sorts of framework and related #
## Runtime environments ##
### Node JS ###
brew "nvm"                # Manage multiple Node.js versions
### Python ###
brew "pipenv"             # Python dependency management tool
brew "pyenv"              # Python version management
brew "pygments"           # Generic syntax highlighter
### Ruby ###
brew "rbenv"              # Ruby version manager
brew "ruby-build"         # Install various Ruby versions and implementations
### Groovy ###
brew "gradle"             # Open-source build automation tool based on the Groovy and Kotlin DSL
### Java ###
cask "homebrew/cask-versions/adoptopenjdk8" # AdoptOpenJDK 8 - Prebuilt OpenJDK binaries
## Databases ##
### MS SQL SERVER ###
brew "msodbcsql"          # ODBC Driver for Microsoft(R) SQL Server(R)
brew "mssql-tools"        # Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
cask "azure-data-studio"  # Azure Data Studio - Data management tool that enables working with SQL Server
## Unsorted ##
cask "kitematic"          # Kitematic - Visual user interface for Docker Container management
cask "docker"             # Docker Desktop - App to build and share containerized applications and microservices
cask "dotnet-sdk"         # .NET SDK - Developer platform
cask "android-sdk"        # android-sdk
brew "azure-cli"          # Microsoft Azure CLI 2.0
brew "dotnet"             # .NET Core
brew "helm"               # Kubernetes package manager
brew "kubectl"            # Kubernetes command-line interface
brew "kubectx"            # Tool that can switch between kubectl contexts easily and create aliases
brew "mono"               # Cross platform, open source .NET development framework
cask "unity-hub"          # Unity Hub - Management tool for Unity

# Development #
cask "visual-studio-code" # Microsoft Visual Studio Code - Open-source code editor
cask "postman"            # Postman - Collaboration platform for API development
cask "hex-fiend"           # Hex Fiend - Hex editor focussing on speed
## Source control ##
brew "gh"                 # GitHub command-line tool
brew "git-secret"         # Bash-tool to store the private data inside a git repo
cask "github"             # GitHub Desktop - Desktop client for GitHub repositories

# Network tools #
brew "nmap"               # Port scanning utility for large networks


# Password management #
brew "macpass"            # Open-source, KeePass-client and password manager
cask "1password"          # Password manager that keeps all passwords secure behind one password

# Archiving utils #
brew "p7zip"              # 7-Zip (high compression file archiver) implementation
brew "pigz"               # Parallel gzip
brew "rar"                # RAR Archiver - Archive manager for data compression and backups
brew "upx"                # Compress/expand executable files

# MEDIA MANIPULATION #
brew "ffmpeg"             # Play, record, convert, and stream audio and video
brew "exiftool"           # Perl lib for reading and writing EXIF metadata
brew "imagemagick"        # Tools and libraries to manipulate images in many formats
brew "streamlink"         # CLI for extracting streams from various websites to a video player
brew "youtube-dl"         # Download YouTube videos from the command-line
cask "vlc"                # VLC media player - Multimedia player

# Web stuff #
brew "nginx"              # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "hugo"               # Configurable static site generator

# VPN Clients #
brew "openconnect"        # Open client for Cisco AnyConnect VPN
brew "openvpn"            # SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
cask "expressvpn"         # ExpressVPN - VPN client for secure internet access and private browsing
cask "nordvpn"            # NordVPN - VPN client for secure internet access and private browsing

# CLI Clients #
#---brew "haste-client"       # CLI client for haste-server
#---brew "gpg"                # GNU Pretty Good Privacy (PGP) package
#---brew "newsbeuter"         # RSS/Atom feed reader for text terminals
#---brew "jrnl"               # Command-line note taker

# Remote clients #
## Browsers ##
cask "brave-browser"      # Brave - Web browser focusing on privacy
#---cask "firefox"            # Mozilla Firefox - Web browser
cask "google-chrome"      # Google Chrome - Web browser
## VNC ##
brew "tiger-vnc"          # High-performance, platform-neutral implementation of VNC
## File transfer clients ##
cask "transmission"       # Transmission - Open-source BitTorrent client
cask "transmit"           # Transmit - File transfer application

# Note taking #
cask "obsidian"           # Obsidian - Knowledge base that works on top of a local folder of plain text Markdown files
cask "notion"             # Notion - App to write, plan, collaborate, and get organized

# Services #
#---cask "spotify"            # Spotify - Music streaming service
#---cask "steam"              # Steam - Video game digital distribution service
#---cask "dropbox"            # Dropbox - Client for the Dropbox cloud storage service
cask "amazon-photos"      # Amazon Photos - Photo storage and sharing service

# Various cool nerd stuff #
brew "s-search"           # Web search from the terminal
cask "dictionaries"       # Dictionaries - Translate words without ever opening a dictionary
cask "font-roboto-mono-nerd-font" # RobotoMono Nerd Font (Roboto Mono) - Developer targeted fonts with a high number of glyphs
cask "focus"              # Focus - Website and application blocker

# Teamwork #
cask "zoom"               # Zoom.us - Video communication and virtual meeting platform
#---cask "discord"            # Discord - Voice and text chat software
cask "microsoft-teams"    # Microsoft Teams - Meet, chat, call, and collaborate in just one place
#---cask "slack"              # Slack - Team communication and collaboration software
cask "signal"             # Signal - Instant messaging application focusing on security
cask "whatsapp"           # WhatsApp - Desktop client for WhatsApp

# Apple Mac Specific stuff #
brew "mas"                # Mac App Store command-line interface
brew "pinentry-mac"       # Pinentry for GPG on Mac
cask "bartender"          # Bartender - Menu bar icon organizer
cask "bleunlock"          # BLEUnlock - Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "keepingyouawake"    # KeepingYouAwake - Tool to prevent the system from going into sleep mode
cask "istat-menus"        # iStats Menus - System monitoring app
## QuickLook plugins ##
cask "qlcolorcode"        # QLColorCode - QuickLook plug-in that renders source code with syntax highlighting
cask "qlimagesize"        # qlImageSize - Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown"         # sbarex-qlmarkdown - QuickLook generator for Markdown files
cask "qlstephen"          # QLStephen - QuickLook plugin for plaintext files without an extension
cask "quicklook-csv"      # QuickLookCSV - QuickLook plugin for CSV files 
cask "quicklook-json"     # quick look JSON - QuickLook plugin for JSON files

# From Apple App store #
mas "Bear", id:1091189122
mas "Todoist", id:585829637
mas "Microsoft Remote Desktop", id:1295203466

# cask "java"             # Unavailable?
# mas "Airmail 3", id: 918858936
# mas "Day One", id: 1055511498
# mas "Magnet", id: 441258766
# mas "Spark", id: 1176895641
# mas "Xcode", id: 497799835
# mas "Paste", id: 967805235

