tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
tap "microsoft/mssql-release"

# Password management #
cask "macpass"            # Open-source, KeePass-client and password manager
cask "1password"          # Password manager that keeps all passwords secure behind one password


# MEDIA MANIPULATION #
brew "ffmpeg"             # Play, record, convert, and stream audio and video
brew "exiftool"           # Perl lib for reading and writing EXIF metadata
brew "imagemagick"        # Tools and libraries to manipulate images in many formats
brew "streamlink"         # CLI for extracting streams from various websites to a video player
brew "youtube-dl"         # Download YouTube videos from the command-line
cask "vlc"                # VLC media player - Multimedia player

# Web stuff #
brew "nginx"              # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "hugo"               # Configurable static site generator

# VPN Clients #
brew "openconnect"        # Open client for Cisco AnyConnect VPN
brew "openvpn"            # SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
cask "expressvpn"         # ExpressVPN - VPN client for secure internet access and private browsing
#cask "nordvpn"            # NordVPN - VPN client for secure internet access and private browsing

# CLI Clients #
#---brew "haste-client"       # CLI client for haste-server
#---brew "gpg"                # GNU Pretty Good Privacy (PGP) package
#---brew "newsbeuter"         # RSS/Atom feed reader for text terminals
#---brew "jrnl"               # Command-line note taker

# Remote clients #
## Browsers ##
cask "brave-browser"      # Brave - Web browser focusing on privacy
#---cask "firefox"            # Mozilla Firefox - Web browser
cask "google-chrome"      # Google Chrome - Web browser
## VNC ##
brew "tiger-vnc"          # High-performance, platform-neutral implementation of VNC
## File transfer clients ##
cask "transmission"       # Transmission - Open-source BitTorrent client
cask "transmit"           # Transmit - File transfer application

# Note taking #
cask "obsidian"           # Obsidian - Knowledge base that works on top of a local folder of plain text Markdown files
cask "notion"             # Notion - App to write, plan, collaborate, and get organized

# Services #
#---cask "spotify"            # Spotify - Music streaming service
#---cask "steam"              # Steam - Video game digital distribution service
#---cask "dropbox"            # Dropbox - Client for the Dropbox cloud storage service
cask "amazon-photos"      # Amazon Photos - Photo storage and sharing service

# Secondary development stuff
cask "postman"            # Postman - Collaboration platform for API development

# Various cool nerd stuff #
brew "s-search"           # Web search from the terminal
cask "dictionaries"       # Dictionaries - Translate words without ever opening a dictionary
cask "font-roboto-mono-nerd-font" # RobotoMono Nerd Font (Roboto Mono) - Developer targeted fonts with a high number of glyphs
cask "focus"              # Focus - Website and application blocker

# Teamwork #
cask "zoom"               # Zoom.us - Video communication and virtual meeting platform
#---cask "discord"            # Discord - Voice and text chat software
cask "microsoft-teams"    # Microsoft Teams - Meet, chat, call, and collaborate in just one place
#---cask "slack"              # Slack - Team communication and collaboration software
cask "signal"             # Signal - Instant messaging application focusing on security
cask "whatsapp"           # WhatsApp - Desktop client for WhatsApp

# Apple Mac Specific stuff #
brew "mas"                # Mac App Store command-line interface
brew "pinentry-mac"       # Pinentry for GPG on Mac
cask "bartender"          # Bartender - Menu bar icon organizer
cask "bleunlock"          # BLEUnlock - Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "keepingyouawake"    # KeepingYouAwake - Tool to prevent the system from going into sleep mode
cask "istat-menus"        # iStats Menus - System monitoring app
## QuickLook plugins ##
cask "qlcolorcode"        # QLColorCode - QuickLook plug-in that renders source code with syntax highlighting
cask "qlimagesize"        # qlImageSize - Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown"         # sbarex-qlmarkdown - QuickLook generator for Markdown files
cask "qlstephen"          # QLStephen - QuickLook plugin for plaintext files without an extension
cask "quicklook-csv"      # QuickLookCSV - QuickLook plugin for CSV files 
cask "quicklook-json"     # quick look JSON - QuickLook plugin for JSON files

# From Apple App store #
mas "Bear", id:1091189122
mas "Todoist", id:585829637
mas "Microsoft Remote Desktop", id:1295203466

# cask "java"             # Unavailable?
# mas "Airmail 3", id: 918858936
# mas "Day One", id: 1055511498
# mas "Magnet", id: 441258766
# mas "Spark", id: 1176895641
# mas "Xcode", id: 497799835
# mas "Paste", id: 967805235

